---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReinforcementSettings.GetFabricRoundingManager
source: html/e8fd5c2d-5fa1-1b02-4e4e-4057680a756e.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementSettings.GetFabricRoundingManager Method

Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.

## Syntax (C#)
```csharp
public FabricRoundingManager GetFabricRoundingManager()
```

## Returns
The rounding manager.